wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
/*!
 * @file main.cpp
 * @brief OpenFIRE Esp32 - 4IR LED Lightgun wireless sketch w/ support for force feedback and other features.
 * Forked from OpenFIRE firmware v6.2 from https://github.com/TeamOpenFIRE/OpenFIRE-Firmware
 * which in itself is forked from IR-GUN4ALL v4.2, which is based on Prow's Enhanced Fork from https://github.com/Prow7/ir-light-gun,
 * which in itself is based on the 4IR Beta "Big Code Update" SAMCO project from https://github.com/samuelballantyne/IR-Light-Gun
 * @n CPP file for Samco Light Gun 4 LED setup
 *
 * @copyright alessandro-satanassi, https://github.com/alessandro-satanassi, 2026
 * @copyright GNU Lesser General Public License
 *
 * @author [Alessandro Satanassi](alessandro@cittini.it)
 * @version V6.0 PreRelease7
 * @date 2026
 * 
 * I thank you for producing the first original code:
 * 
 * @copyright Samco, https://github.com/samuelballantyne, June 2020
 * @copyright Mike Lynch, July 2021
 * @copyright That One Seong, https://github.com/SeongGino, 2024
 * @copyright GNU Lesser General Public License
 *
 * @author [Sam Ballantyne](samuelballantyne@hotmail.com)
 * @author Mike Lynch
 * @author [That One Seong](SeongsSeongs@gmail.com)
 * @date 2025
 */

#include "OpenFIREmain.h"
#include "OpenFIREPlayTimer.h"
#include "OpenFIREBoyMode.h"
#include "boards/OpenFIREshared.h"
#include "OpenFIREcolors.h"
#include "OpenFIRElights.h"
#include "OpenFIREserial.h"
#include "OpenFIREFeedback.h"
#include "OpenFIREprefs.h"
#include "OpenFIREconstant.h"
#ifdef USES_DISPLAY
#include "OpenFIREdisplay_i18n.h"
#endif

// ===================================================================================
// OS ABSTRACTION: RIDEFINIZIONE DEL DELAY (FREERTOS)
// ===================================================================================
// Sostituendo la funzione nativa bloccante con vTaskDelay, garantiamo che 
// lo scheduler di FreeRTOS possa cedere il controllo ad altri task (es. radio o display) 
// durante le attese, prevenendo lo stallo dell'intero sistema operativo.
#ifdef ARDUINO_ARCH_ESP32  // [ESP32_PORT]
    #define delay(ms) vTaskDelay(pdMS_TO_TICKS(ms))                    
#endif //ARDUINO_ARCH_ESP32

// ===================================================================================
// CONDIVISIONE RISORSE DISPLAY
// ===================================================================================
// Esponendo un puntatore reference (*&), permettiamo al modulo Wireless, isolato 
// in altri thread, di iniettare animazioni di stato (es. "Searching...") 
// direttamente sul display, aggirando l'incapsulamento standard del firmware.
// ========== serve per usare display da parte wireless =============
#ifdef USES_DISPLAY
    #ifdef USE_LOVYAN_GFX
        LGFX_SSD1306 *&display_OLED  = FW_Common::OLED.display;   //aggiunto inline per condividerla
    #else
        Adafruit_SSD1306 *&display_OLED  = FW_Common::OLED.display; //aggiunto inline per condividerla
    #endif
#endif // USES_DISPLAY
// ========== fine serve per usare display da parte wireless =============


// ===================================================================================
// MULTITHREADING (CORE 1) E WATCHDOG
// ===================================================================================
// Il setup del dual-core scarica cicli preziosi. Tuttavia, il vTaskDelay(1) 
// è essenziale architettonicamente: costringe il task a dormire 1 ms permettendo 
// al task Idle nascosto di FreeRTOS di girare. Senza questo respiro, il Core si 
// bloccherebbe e l'Hardware Watchdog riavvierebbe la scheda in panic.

// =======[ESP32_PORT]===== GESTIONE DUAL CORE PER ESP32 CHE USA FREERTOS ===  INIZIALIZZAZIONE ========
#if defined(ARDUINO_ARCH_ESP32) && defined(DUAL_CORE)
    void setup1();
    void loop1();
    TaskHandle_t task_loop1;
    void esploop1(void* pvParameters) {
        setup1();
        for (;;) {
            loop1();
            // Blocca questo task per 1 millisecondo (o 1 tick).
            // Questo permette all'Idle Task (priorità 0) di girare, 
            // nutrire il Watchdog e pulire il sistema.
            vTaskDelay(pdMS_TO_TICKS(1));
        }
    }
#endif
// ======[ESP32_PORT]============= FINE GESTIONE DUAL CORE ESP32 ==== FINE INIZIALIZZAZIONE ============


// Sets up the environment
void setup() {

    // ======== [ESP32_PORT] =========== X AVVIO DUAL CORE ESP32 =================================== 
    #if defined(ARDUINO_ARCH_ESP32) && defined(DUAL_CORE)
        #define STACK_SIZE_SECOND_CORE 4096 // stack size
        #define PRIORITY_SECOND_CORE 1      // priority task
        xTaskCreatePinnedToCore(
        esploop1,                           // Task function
        "loop1",                            // name of task
        STACK_SIZE_SECOND_CORE,             // Stack size of task
        NULL,                               // parameter of the task
        PRIORITY_SECOND_CORE,               // priority of the task
        &task_loop1,                        // Task handle to keep track of created task
        !ARDUINO_RUNNING_CORE);             // pin task to core 0
    #endif
    // ======= [ESP32_PORT] ========= FINE X AVVIO DUAL CORE ESP32 =================================

    // ===================================================================================
    // HARDWARE FAILSAFES (I2C & ADC)
    // ===================================================================================
    // La stabilità fisica dell'hardware vario (cloni Arduino, cablaggi lunghi) è imprevedibile.
    // I timeout I2C prevengono blocchi infiniti del bus. I pin GPIO tenuti alti 
    // compensano quirk noti di board specifiche (es. stabilizzare l'LDO del Pico).

    // In case some I2C devices deadlock the program
    // (can happen due to bad pin mappings)
    Wire.setTimeout(100);
    Wire1.setTimeout(100);
  
    #ifdef ARDUINO_ADAFRUIT_ITSYBITSY_RP2040
        // SAMCO 1.1 needs Pin 5 normally HIGH for the camera
        pinMode(14, OUTPUT);
        digitalWrite(14, HIGH);
    #endif // ARDUINO_ADAFRUIT_ITSYBITSY_RP2040
    #ifdef ARDUINO_RASPBERRY_PI_PICO
        // Pull switching regulator pin high to stabilize reads from ADC (analog pins)
        pinMode(23, OUTPUT);
        digitalWrite(23, HIGH);
    #endif

    // ===================================================================================
    // FORZATURA HARDWARE ADC (Previene futuri bug se cambiano i default di libreria)
    // ===================================================================================
    #if defined(ARDUINO_ARCH_ESP32) && defined(USES_ANALOG)
        
        // Fissa l'ADC a 12-bit (scala 0-4095). 
        // Vitale: tutte le costanti (es. centro a 2048) e le formule dipendono da questo.
        analogReadResolution(12); 
    
        // Fissa l'attenuazione a 11dB (misura fino a ~3.1V).
        // Vitale: impedisce che l'ADC saturi a tensioni basse, garantendo
        // l'escursione totale del joystick e la corretta lettura del TMP36.
        analogSetAttenuation(ADC_11db);
        
    #endif // defined(ARDUINO_ARCH_ESP32) && defined(USES_ANALOG)


    // ===================================================================================
    // DATA INTEGRITY & PROFILAZIONE
    // ===================================================================================
    // Una EEPROM (o File System) corrotta può caricare valori di offset impossibili, 
    // distruggendo la matematica del tracking IR. Questo blocco agisce come "Sanitizer", 
    // forzando il fallback a valori sicuri prima che il software possa crashare.

    // Init pins array, and OFPresets for later load ops
    OF_Prefs::LoadPresets();
    
