wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)// SE WIRELESS
        #define MILLIS_TIMEOUT  3000 //1 secondi  检测USB是否连接的时间！！！1秒
        #define BOY_MODE_WINDOW_MS 3000 // Boy 模式按键判定窗口（毫秒）
        unsigned long lastMillis = millis();
        // 先给 USB 一段时间看看是否被挂载
        while ((millis() - lastMillis <= MILLIS_TIMEOUT) && (!TinyUSBDevice.mounted())) { yield(); }

        // 如果 USB 还没挂载，先给 Boy Mode 一个 3 秒窗口，再决定要不要去扫无线
        if (!TinyUSBDevice.mounted())
        {
            BoyMode::BeginDecisionWindow(BOY_MODE_WINDOW_MS);
            while (!TinyUSBDevice.mounted() &&
                   !BoyMode::IsEnabled() &&
                   (millis() - lastMillis <= (MILLIS_TIMEOUT + BOY_MODE_WINDOW_MS))) {
                yield();  // 先让 USB 有机会处理
                BoyMode::TickDecisionWindow();
            }
            // 如果启用了 Boy Mode，这里不要做额外外设操作，避免在启动阶段阻塞
            if (BoyMode::IsEnabled())
            {
                // 进入后由后续 Boy 模式分支接管
            }
        }

        // 只有在没进 Boy Mode 的情况下，才真正去做无线连接/扫描
        if (!TinyUSBDevice.mounted() && !BoyMode::IsEnabled()) {
            SerialWireless.init_wireless();
            SerialWireless.begin();
            if (lastDongleSave) {
                // PROVA A CONNETTERTI AL PRECEDENTE DONGLE INVIANDO IL PACCHETTO CHECK_CONNECTION
                if (SerialWireless.connection_gun_at_last_dongle()) {
                } else {
                    SerialWireless.connection_gun();
                }
            }
            else {
                SerialWireless.connection_gun();
            }
        }
    #else
        while(!TinyUSBDevice.mounted() && !TinyUSBDevices.onBattery) { yield(); }
    #endif


    // arriva qui solo se e' stato connesso l'usb, e' stata negoziata una connessione wireless, oppure Boy Mode è attivo
    #ifdef ARDUINO_ARCH_ESP32
        #ifdef USES_DISPLAY
            if (TinyUSBDevice.mounted() || TinyUSBDevices.onBattery) {
                FW_Common::OLED.TopPanelUpdate(TXT_TOP_LINK_READY);
                vTaskDelay(pdMS_TO_TICKS(1000));
            } else if (BoyMode::IsEnabled()) {
                FW_Common::OLED.TopPanelUpdate(TXT_TOP_BOY_READY);
                vTaskDelay(pdMS_TO_TICKS(600));
            }
        #endif //USES_DISPLAY
    #endif // ARDUINO_ARCH_ESP32

    if (TinyUSBDevice.mounted() || BoyMode::IsEnabled()) {
        // Boy 模式下按“有线已就绪”路径处理，避免切到无线串流分支
        TinyUSBDevices.onBattery = false;
        Serial.begin(9600);
        Serial.setTimeout(0);
        FW_Common::OLED.TopPanelUpdate(TXT_TOP_USB_MOUNT);
        #if defined(ARDUINO_ARCH_ESP32)
            //// tolto perchè con nuova versione arduino-esp32 o tinyUSB non funziona più bene ///// Serial.setTxTimeoutMs(0);
            //////////////////////Serial.setTxTimeoutMs(0); // default è 250ms // serve per fare come in arduino pico rp2040
            //Serial.setRxBufferSize(64); // impostato con per arduino pico .. se non si imposta è 256 di default
            //Serial.setRxBufferSize(usbPackageSize + 128);
            //Serial.setTxBufferSize(64);
        #endif // ARDUINO_ARCH_ESP32
        #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
            if (TinyUSBDevices.onBattery) {  // nel caso incredibile che l'USB sia montato nel momnto esatto in cui è stata stabilita connessione wireless
                TinyUSBDevices.onBattery = false;
            }
            if (TinyUSBDevices.wireless_mode != WIRELESS_MODE::NONE_WIRELESS) SerialWireless.end();
        #endif 
        Serial_OpenFIRE_Stream = & Serial;

    }  
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
    else {     
        // Only update "last dongle" if we actually have a negotiated wireless link.
        if(!BoyMode::IsEnabled()) {
            if (!lastDongleSave || 
                (lastDongleSave && (!(memcmp(lastDongleAddress, peerAddress,6) == 0) || !(lastDongleChannel == espnow_wifi_channel))))
                OF_Prefs::SaveLastDongleWireless(peerAddress, &espnow_wifi_channel);
        }
        // CHIUDI TUTTO CIO' CHE E' USB SE E' DA CHIUDERE
        // Salvaguarda la memoria e previene errori del core USB quando non è connesso fisicamente.
        TinyUSBDevice.clearConfiguration();
        TinyUSBDevice.detach();
        
        Serial_OpenFIRE_Stream = &SerialWireless;

        // GESTIONE DEL PEDALE WIRELESS
        if((OF_Prefs::pins[OF_Const::btnPedal] == -1) && (OF_Prefs::pins[OF_Const::btnPedal2] == -1)) {
            if (lastPedalSave && (lastPedalChannel == espnow_wifi_channel)) {
                if (!SerialWireless.connection_gun_at_last_pedal()) SerialWireless.connection_gun_at_pedal();
            } else SerialWireless.connection_gun_at_pedal();
        }
        else {
            // invia segnale al dongle che la procedura del PEDAL è completa
              SerialWireless.tx_gun_at_dongle_pedal_ready();
        }
        
        // salva l'ultimo pedale connesso
        if (TinyUSBDevices.is_pedal_wireless && (!lastPedalSave || 
            (lastPedalSave && (!(memcmp(lastPedalAddress, peerAddress_pedal,6) == 0) || !(lastPedalChannel == espnow_wifi_channel))))) OF_Prefs::SaveLastPedalWireless(peerAddress_pedal, &espnow_wifi_channel);
  
        // ===== FINE GESTIONE DEL PEDALE ================

    }
    #endif

    //////////////////////////////////////////////////////////////////////////////////////////////////////////
    // === [ESP32_PORT] === FINE NUOVA GESTIONE INIZIALIZZAIZONE USB O CONNESSIONE WIRELESS =============== //
    ////////////////////////////////////////////////////////////////////////////////////////////////////////// 
    #endif
#endif //USE_TINYUSB

    // ripristina la parte superiore del diplay come in originale
    #ifdef ARDUINO_ARCH_ESP32
    #ifdef USES_DISPLAY
        FW_Common::OLED.ScreenModeChange(ExtDisplay::ScreenMode_e::Screen_None);
    #endif // USES_DISPLAY
    #endif //ARDUINO_ARCH_ESP32

// ===================================================================================
// POLYMORPHIC I/O: IL TRUCCO DELLA SERIALE VIRTUALE
// ===================================================================================
// Architettura per retrocompatibilità. Ridefinendo la macro `Serial` per 
// puntare al nostro stream dereferenziato (*Serial_OpenFIRE_Stream), l'intera codebase 
// legacy (nata per USB wired) può usare `Serial.print` e `Serial.write` come sempre. 
// I dati verranno instradati via Cavo o via Rete (ESP-NOW) a seconda 
// dell'esito della negoziazione precedente.

    //////////////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////// [ESP32_PORT] ////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////////////
    
    #ifdef OPENFIRE_WIRELESS_ENABLE
        #ifdef Serial
            #undef Serial
        #endif
        #define Serial (*Serial_OpenFIRE_Stream)
    #endif // OPENFIRE_WIRELESS_ENABLE
    
    //////////////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////// [ESP32_PORT] ////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////////////


    // AbsMouse5.init(true); // [ESP32_PORT] rimosso per il mio nuovo OpenFire_TinyDevice

    // IR camera maxes out motion detection at ~300Hz, and millis() isn't good enough
    // L'esecuzione wireless introduce overhead. Ridurre il tick rate della telecamera IR 
    // su batteria (da 5ms a ~15ms) offre più CPU all'ESP-NOW limitando possibili lag di sistema, ma
    // ho riscontrato che funziona comunque bene alla stessa frequenza usata con connessione via cavo,
    // quindi l'ho impostata uguale ovvero 209Hz che corrisponde a circa 5ms
    if (TinyUSBDevices.onBattery) startIrCamTimer(209);  // impostato a 5ms anche per wireless ... es. 100->10ms 66 -> 15ms per connessione wireless
      else startIrCamTimer(209); // 5ms per connessione via cavo
    
    FW_Common::OpenFIREper.source(OF_Prefs::profiles[OF_Prefs::currentProfile].adjX,
                                  OF_Prefs::profiles[OF_Prefs::currentProfile].adjY);
    FW_Common::OpenFIREper.deinit(0);

    // Boy 模式只需要基本硬件初始化，直接进入 Run，不需要首启校准/无线等后续流程
    if (BoyMode::IsEnabled())
    {
        FW_Common::SetMode(FW_Const::GunMode_Run);
        return;
    }

    // First boot sanity checks; all zeroes are initial config
    if((OF_Prefs::profiles[OF_Prefs::currentProfile].topOffset    == 0 &&
        OF_Prefs::profiles[OF_Prefs::currentProfile].bottomOffset == 0 && 
        OF_Prefs::profiles[OF_Prefs::currentProfile].leftOffset   == 0 &&
        OF_Prefs::profiles[OF_Prefs::currentProfile].rightOffset  == 0)) {

        // This is a first boot! Prompt to start calibration.
        unsigned int timerIntervalShort = 600;
        unsigned int timerInterval = 1000;
        OF_RGB::LedOff();
        unsigned long lastT = millis();
        bool LEDisOn = false;

