wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
            // 震动反馈
            #ifdef USES_RUMBLE
                if(OF_Prefs::toggles[OF_Const::rumble]) {
                    // 短震动反馈
                    analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
                    delay(200);
                    #ifdef ARDUINO_ARCH_ESP32
                        analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0);
                    #else // rp2040
                        digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                    #endif
                }
            #endif // USES_RUMBLE
            
            // Save the new mode settings
            OF_Prefs::toggles[OF_Const::analogOutputMode] = FW_Common::buttons.analogOutput;
            OF_Prefs::toggles[OF_Const::misterMode] = FW_Common::OLED.mister;
            OF_Prefs::SaveToggles();
            
            // Update display to show new mode
            #ifdef USES_DISPLAY
                if(FW_Common::buttons.analogOutput) {
                    FW_Common::OLED.TopPanelUpdate(TXT_TOP_MODE_GAMEPAD);
                } else {
                    FW_Common::OLED.TopPanelUpdate(TXT_TOP_MODE_MOUSEKB);
                }
                // Briefly show status then update menu
                delay(1000); // Show status for 1 second
                FW_Common::OLED.PauseListUpdate((int)FW_Common::pauseModeSelection);
            #endif // USES_DISPLAY
            
            // 恢复RGB灯到正常模式颜色
            #ifdef LED_ENABLE
                delay(500); // 保持反馈颜色0.5秒
                FW_Common::SetLedColorFromMode(); // 恢复根据当前模式的颜色
            #endif // LED_ENABLE
        }

        if(OF_Prefs::toggles[OF_Const::holdToPause]) {
            if(FW_Common::buttons.debounced == FW_Const::EnterPauseModeHoldBtnMask
               && !FW_Common::lastSeen && !pauseHoldStarted) {
                pauseHoldStarted = true;
                pauseHoldStartstamp = millis();
                if(!OF_Serial::serialMode)
                    Serial.println("Started holding pause mode signal buttons!");

            } else if(pauseHoldStarted && (FW_Common::buttons.debounced != FW_Const::EnterPauseModeHoldBtnMask || FW_Common::lastSeen)) {
                pauseHoldStarted = false;
                if(!OF_Serial::serialMode)
                    Serial.println("Either stopped holding pause mode buttons, aimed onscreen, or pressed other buttons");

            } else if(pauseHoldStarted) {
                unsigned long t = millis();
                if(t - pauseHoldStartstamp > OF_Prefs::settings[OF_Const::holdToPauseLength]) {
                    // in the infinitely tiny chance that this happens at the same time as a serial-pinged Dock request:
                    if(FW_Common::gunMode == FW_Const::GunMode_Run) {
                        // Signal the main core to set mode, since it's more stable there.
                        // Pop blocks until we get the okay from the main core (the value returned doesn't matter atm)
                        #ifdef ARDUINO_ARCH_ESP32
                            esp32_fifo.push(FW_Const::GunMode_Pause);
                            esp32_fifo.pop();
                        #else // rp2040 
                        rp2040.fifo.push(FW_Const::GunMode_Pause);
                        rp2040.fifo.pop();
                        #endif
                    }
                }
            }
        } else {
            if(FW_Common::buttons.pressedReleased == FW_Const::EnterPauseModeBtnMask ||
               FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Home) {
                // in the infinitely tiny chance that this happens at the same time as a serial-pinged Dock request:
                if(FW_Common::gunMode == FW_Const::GunMode_Run) {
                    // Signal the main core to set mode, since it's more stable there.
                    // Pop blocks until we get the okay from the main core (the value returned doesn't matter atm)
                    #ifdef ARDUINO_ARCH_ESP32
                        esp32_fifo.push(FW_Const::GunMode_Pause);
                        esp32_fifo.pop();
                    #else // rp2040                    
                    rp2040.fifo.push(FW_Const::GunMode_Pause);
                    rp2040.fifo.pop();
                    #endif
                }
            }
        }
        #ifndef COMMENTO
        #if defined(ARDUINO_ARCH_ESP32) && defined(DUAL_CORE)
        // Blocca questo task per 1 millisecondo (o 1 tick).
        // Questo permette all'Idle Task (priorità 0) di girare, 
        // nutrire il Watchdog e pulire il sistema.
        vTaskDelay(pdMS_TO_TICKS(1));
        //yield();
        #endif // defined(ARDUINO_ARCH_ESP32) && defined(DUAL_CORE)
        #endif // COMMENTO
    }
}
#endif // DUAL_CORE
// #endif // ARDUINO_ARCH_RP2040 // [ESP32_PORT] tolto messo sopra

// Main core events hub
// splits off into subsequent ExecModes depending on circumstances
void loop()
{
    // Boy 模式只影响启动连接决策；运行期沿用原有触发/反馈逻辑

    // poll/update button states with 1ms interval so debounce mask is more effective
    FW_Common::buttons.Poll(1);
    FW_Common::buttons.Repeat();

    // 更新计时器（ESP32 不会跑 loop1，因此这里必须 Tick）
    PlayTimer::Tick();

    // 倒计时显示由 ExtDisplay::IdleOps() 统一驱动，避免多线程/覆盖问题

    if(OF_Prefs::toggles[OF_Const::holdToPause] && pauseHoldStarted) {
        #ifdef USES_RUMBLE
            if(OF_Prefs::toggles[OF_Const::rumble]) {
                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
                delay(300);
                #ifdef ARDUINO_ARCH_ESP32
                    analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0); // [ESP32_PORT] per ESP32
                #else //rp2040
                digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                #endif
            }
        #endif // USES_RUMBLE

        // if any buttons are still held, keep polling until all buttons are debounced
        while(FW_Common::buttons.debounced)
            FW_Common::buttons.Poll(1);

