wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
                            #ifdef USES_DISPLAY
                                FW_Common::OLED.TopPanelUpdate(TXT_TOP_RANGECAL_ROTATE);
                            #endif

                            uint16_t minX = 4095, maxX = 0, minY = 4095, maxY = 0;
                            const uint32_t sampleMs = 4200;
                            uint32_t t0 = millis();
                            while (millis() - t0 < sampleMs) {
                                int x = analogRead(pinX);
                                int y = analogRead(pinY);
                                if (x < (int)minX) minX = (uint16_t)x;
                                if (x > (int)maxX) maxX = (uint16_t)x;
                                if (y < (int)minY) minY = (uint16_t)y;
                                if (y > (int)maxY) maxY = (uint16_t)y;
                                delay(2);
                            }

                            #ifdef USES_DISPLAY
                                FW_Common::OLED.TopPanelUpdate(TXT_TOP_RANGECAL_RELEASE);
                            #endif

                            delay(250); // 让摇杆回中后稍微稳定一下
                            const int centerSamples = 64;
                            uint32_t sumX = 0, sumY = 0;
                            for (int i = 0; i < centerSamples; ++i) {
                                sumX += (uint32_t)analogRead(pinX);
                                sumY += (uint32_t)analogRead(pinY);
                                delay(5);
                            }
                            uint16_t cenX = (uint16_t)(sumX / (uint32_t)centerSamples);
                            uint16_t cenY = (uint16_t)(sumY / (uint32_t)centerSamples);

                            // 计算“中心偏移”（复用原有 CenterCal 存储语义）
                            int32_t offsetX = (int32_t)ANALOG_STICK_CENTER_X - (int32_t)cenX;
                            int32_t offsetY = (int32_t)ANALOG_STICK_CENTER_Y - (int32_t)cenY;
                            const int32_t maxOffset = 512;
                            if (offsetX < -maxOffset) offsetX = -maxOffset;
                            if (offsetX >  maxOffset) offsetX =  maxOffset;
                            if (offsetY < -maxOffset) offsetY = -maxOffset;
                            if (offsetY >  maxOffset) offsetY =  maxOffset;

                            // 把采到的边缘范围平移到“应用中心偏移之后”的空间保存
                            int32_t calMinX = (int32_t)minX + offsetX;
                            int32_t calMaxX = (int32_t)maxX + offsetX;
                            int32_t calMinY = (int32_t)minY + offsetY;
                            int32_t calMaxY = (int32_t)maxY + offsetY;

                            if (calMinX < ANALOG_STICK_MIN_X) calMinX = ANALOG_STICK_MIN_X;
                            if (calMaxX > ANALOG_STICK_MAX_X) calMaxX = ANALOG_STICK_MAX_X;
                            if (calMinY < ANALOG_STICK_MIN_Y) calMinY = ANALOG_STICK_MIN_Y;
                            if (calMaxY > ANALOG_STICK_MAX_Y) calMaxY = ANALOG_STICK_MAX_Y;

                            uint32_t ok = 0;
                            // 简单有效性判断：范围太小就不启用缩放（仍然保存中心偏移）
                            if ((calMaxX - calMinX) >= 600 && (calMaxY - calMinY) >= 600) ok = 1;

                            OF_Prefs::settings[OF_Const::analogCenterOffsetX] = (uint32_t)offsetX;
                            OF_Prefs::settings[OF_Const::analogCenterOffsetY] = (uint32_t)offsetY;
                            OF_Prefs::settings[OF_Const::analogCalMinX] = (uint32_t)calMinX;
                            OF_Prefs::settings[OF_Const::analogCalMaxX] = (uint32_t)calMaxX;
                            OF_Prefs::settings[OF_Const::analogCalMinY] = (uint32_t)calMinY;
                            OF_Prefs::settings[OF_Const::analogCalMaxY] = (uint32_t)calMaxY;
                            OF_Prefs::settings[OF_Const::analogCalValid] = ok;

                            int saveErr = OF_Prefs::SaveSettings();
                            FW_Common::analogCenterJustCalibrated = true;

                            if (!OF_Serial::serialMode) {
                                Serial.print("RangeCal: rawMinX="); Serial.print(minX);
                                Serial.print(" rawMaxX="); Serial.print(maxX);
                                Serial.print(" rawMinY="); Serial.print(minY);
                                Serial.print(" rawMaxY="); Serial.println(maxY);
                                Serial.print("RangeCal: cenX="); Serial.print(cenX);
                                Serial.print(" cenY="); Serial.print(cenY);
                                Serial.print(" offX="); Serial.print(offsetX);
                                Serial.print(" offY="); Serial.println(offsetY);
                                Serial.print("RangeCal: calMinX="); Serial.print(calMinX);
                                Serial.print(" calMaxX="); Serial.print(calMaxX);
                                Serial.print(" calMinY="); Serial.print(calMinY);
                                Serial.print(" calMaxY="); Serial.print(calMaxY);
                                Serial.print(" OK="); Serial.print(ok ? "1" : "0");
                                Serial.print(" Save=");
                                Serial.println(saveErr == 0 ? "OK" : "FAIL");
                            }

                            #ifdef USES_DISPLAY
                                FW_Common::OLED.TopPanelUpdate(ok ? TXT_TOP_RANGECAL_OK : TXT_TOP_RANGECAL_WEAK);
                                delay(900);
                                FW_Common::OLED.PauseListUpdate((int)FW_Common::pauseModeSelection);
                            #endif
                        }
                        break;
                        case FW_Const::PauseMode_AutofireToggle:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Toggling autofire...");
                          }
                          OF_Prefs::toggles[OF_Const::autofire] = !OF_Prefs::toggles[OF_Const::autofire];
                          if(!OF_Serial::serialMode) {
                              Serial.print("Autofire is now ");
                              Serial.println(OF_Prefs::toggles[OF_Const::autofire] ? "ON" : "OFF");
                          }
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              {
                                  char buf[24];
                                  snprintf(buf, sizeof(buf), TXT_TOP_AUTOFIRE_FMT,
                                      OF_Prefs::toggles[OF_Const::autofire] ? PM_ON : PM_OFF);
                                  FW_Common::OLED.TopPanelUpdate(buf);
                              }
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AutofireToggle);
                          #endif // USES_DISPLAY
                          #ifdef LED_ENABLE
                              if(OF_Prefs::toggles[OF_Const::autofire]) {
                                  OF_RGB::LedUpdate(0,255,0);
                              } else {
                                  OF_RGB::LedUpdate(255,0,0);
                              }
                              delay(200);
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          OF_Prefs::SaveToggles();
                          break;                          
 //wei13402 add start
                         case FW_Const::PauseMode_ModeChange:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Changing input mode...");
                          }
                          // Cycle through modes: Mouse/KB -> Gamepad -> MiSTer Optimized -> Mouse/KB
                          if(!FW_Common::buttons.analogOutput && !FW_Common::OLED.mister) {
                              // Current: Mouse/KB -> Switch to Gamepad
                              FW_Common::buttons.analogOutput = true;
                              FW_Common::UpdateBindings(false);  // Apply custom button mappings
                              if(!OF_Serial::serialMode)
                                  Serial.println("Mode changed to: Gamepad");
                          } else if(FW_Common::buttons.analogOutput && !FW_Common::OLED.mister) {
                              // Current: Gamepad -> Switch to MiSTer Optimized
                              FW_Common::OLED.mister = true;
                              if(!OF_Serial::serialMode)
                                  Serial.println("Mode changed to: MiSTer Optimized");
                          } else {
                              // Current: MiSTer Optimized -> Switch to Mouse/KB
                              FW_Common::buttons.analogOutput = false;
                              FW_Common::OLED.mister = false;
                              FW_Common::UpdateBindings(false);  // Apply custom button mappings
                              if(!OF_Serial::serialMode)
                                  Serial.println("Mode changed to: Mouse/Keyboard");
                          }
                          
                          // Save the new mode settings
                          OF_Prefs::toggles[OF_Const::analogOutputMode] = FW_Common::buttons.analogOutput;
                          OF_Prefs::toggles[OF_Const::misterMode] = FW_Common::OLED.mister;
                          OF_Prefs::SaveToggles();
                          
                          // Update display to show new mode
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              if(FW_Common::OLED.mister) {
                                  FW_Common::OLED.TopPanelUpdate(TXT_TOP_MODE_MISTER);
                              } else if(FW_Common::buttons.analogOutput) {
                                  FW_Common::OLED.TopPanelUpdate(TXT_TOP_MODE_GAMEPAD);
                              } else {
                                  FW_Common::OLED.TopPanelUpdate(TXT_TOP_MODE_MOUSEKB);
                              }
                              // 短暂显示状态后再更新菜单
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_ModeChange);
                          #endif // USES_DISPLAY
                          // Provide visual feedback
                          #ifdef LED_ENABLE
                              for(uint i = 0; i < 2; ++i) {
                                  OF_RGB::LedUpdate(0,255,255);
                                  delay(150);
                                  OF_RGB::LedOff();
                                  delay(100);
                              }
                          #endif // LED_ENABLE
                          break;
 //wei13102 add end
 //wei134102 add start
                         
                        case FW_Const::PauseMode_LowButtonToggle:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Toggling Low Button Mode!");
                          }
                          OF_Prefs::toggles[OF_Const::lowButtonsMode] = !OF_Prefs::toggles[OF_Const::lowButtonsMode];
                          if(!OF_Serial::serialMode) {
                              Serial.print("Low Button Mode ");
                              Serial.println(OF_Prefs::toggles[OF_Const::lowButtonsMode] ? "ON" : "OFF");
                          }
                          // Update display to show new state
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              {
                                  char buf[24];
                                  snprintf(buf, sizeof(buf), TXT_TOP_LOW_BTN_FMT,
                                      OF_Prefs::toggles[OF_Const::lowButtonsMode] ? PM_ON : PM_OFF);
                                  FW_Common::OLED.TopPanelUpdate(buf);
                              }
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_LowButtonToggle);
                          #endif // USES_DISPLAY
                          // Provide visual feedback
                          #ifdef LED_ENABLE
                              for(uint i = 0; i < 2; ++i) {
                                  OF_RGB::LedUpdate(255,165,0);
                                  delay(150);
                                  OF_RGB::LedOff();
                                  delay(100);
                              }
                          #endif // LED_ENABLE
                          OF_Prefs::SaveToggles();
                          // 更新按钮绑定以应用Low Button模式变更
                          FW_Common::UpdateBindings(false);
                          break;
                        case FW_Const::PauseMode_LayoutToggle:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Toggling Layout Type!");
                          }
                          // Toggle between Diamond and Square layout
                          if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond) {
                              OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout = OF_Const::layoutSquare;
                          } else {
                              OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout = OF_Const::layoutDiamond;
                          }
                          
                          if(!OF_Serial::serialMode) {
                              Serial.print("Layout changed to: ");
                              Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond ? "Diamond" : "Square");
                          }
                          
