wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
                        if(FW_Common::runMode == FW_Const::RunMode_Processing) {
                            switch(OF_Prefs::profiles[OF_Prefs::currentProfile].runMode) {
                                case FW_Const::RunMode_Normal:
                                  FW_Common::SetRunMode(FW_Const::RunMode_Normal);
                                  break;
                                case FW_Const::RunMode_Average:
                                  FW_Common::SetRunMode(FW_Const::RunMode_Average);
                                  break;
                                case FW_Const::RunMode_Average2:
                                  FW_Common::SetRunMode(FW_Const::RunMode_Average2);
                                  break;
                                default:
                                  break;
                            }
                        }

                        #ifdef USES_RUMBLE
                            if(OF_Prefs::toggles[OF_Const::rumble]) for(uint i = 0; i < 3; ++i) {
                                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
                                delay(80);
                                #ifdef ARDUINO_ARCH_ESP32
                                    analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0);  // [ESP32_PORT] per ESP32
                                #else // rp2040
                                digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                                #endif
                                delay(50);
                            }
                        #endif // USES_RUMBLE

                        // 长按退出暂停时同样启动计时
                        PlayTimer::ResetAndStart();

                        // if any buttons are still held, keep polling until all buttons are debounced
                        while(FW_Common::buttons.debounced)
                            FW_Common::buttons.Poll(1);

                        FW_Common::SetMode(FW_Const::GunMode_Run);
                        pauseExitHoldStarted = false;
                    }
                } else if(FW_Common::buttons.debounced & FW_Const::ExitPauseModeHoldBtnMask) {
                    pauseExitHoldStarted = true;
                    pauseHoldStartstamp = millis();
                } else if(FW_Common::buttons.pressedReleased & FW_Const::ExitPauseModeHoldBtnMask)
                    pauseExitHoldStarted = false;

            } else if(FW_Common::buttons.pressedReleased & FW_Const::ExitPauseModeBtnMask) {
                FW_Common::SetMode(FW_Const::GunMode_Run);
            } else if(FW_Common::buttons.pressedReleased == FW_Const::EscapeKeyTrigCABtnMask) {
                SendEscapeKey();
            } else if(FW_Common::buttons.pressedReleased == FW_Const::ToggleMouseGamepadBtnMask) {
                // Toggle between mouse and gamepad mode
                if(!OF_Serial::serialMode) {
                    Serial.println("Toggling input mode...");
                }
                
                // Only toggle between mouse and gamepad mode, ignore MISTER mode
                if(!FW_Common::buttons.analogOutput) {
                    // Current: Mouse/KB -> Switch to Gamepad
                    FW_Common::buttons.analogOutput = true;
                    FW_Common::OLED.mister = false; // Ensure MISTER mode is disabled
                    FW_Common::UpdateBindings(false);
                    if(!OF_Serial::serialMode)
                        Serial.println("Mode changed to: Gamepad");
                    
                    // RGB灯反馈：蓝色表示手柄模式
                    #ifdef LED_ENABLE
                        OF_RGB::LedUpdate(0, 0, 255); // 蓝色
                    #endif // LED_ENABLE
                } else {
                    // Current: Gamepad -> Switch to Mouse/KB
                    FW_Common::buttons.analogOutput = false;
                    FW_Common::OLED.mister = false; // Ensure MISTER mode is disabled
                    FW_Common::UpdateBindings(false);
                    if(!OF_Serial::serialMode)
                        Serial.println("Mode changed to: Mouse/Keyboard");
                    
                    // RGB灯反馈：绿色表示鼠标模式
                    #ifdef LED_ENABLE
                        OF_RGB::LedUpdate(0, 255, 0); // 绿色
                    #endif // LED_ENABLE
                }
                
                // 震动反馈
                #ifdef USES_RUMBLE
                    if(OF_Prefs::toggles[OF_Const::rumble]) {
                        // 短震动反馈
                        analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
                        delay(200);
                        #ifdef ARDUINO_ARCH_ESP32
                            analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0);
                        #else // rp2040
                            digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                        #endif
                    }
                #endif // USES_RUMBLE
                
                // Save the new mode settings
                OF_Prefs::toggles[OF_Const::analogOutputMode] = FW_Common::buttons.analogOutput;
                OF_Prefs::toggles[OF_Const::misterMode] = FW_Common::OLED.mister;
                OF_Prefs::SaveToggles();
                
                // Update display to show new mode
                #ifdef USES_DISPLAY
                    if(FW_Common::buttons.analogOutput) {
                        FW_Common::OLED.TopPanelUpdate(TXT_TOP_MODE_GAMEPAD);
                    } else {
                        FW_Common::OLED.TopPanelUpdate(TXT_TOP_MODE_MOUSEKB);
                    }
                    // Briefly show status then update menu
                    delay(1000); // Show status for 1 second
                    FW_Common::OLED.PauseListUpdate((int)FW_Common::pauseModeSelection);
                #endif // USES_DISPLAY
                
                // 恢复RGB灯到正常模式颜色
                #ifdef LED_ENABLE
                    delay(500); // 保持反馈颜色0.5秒
                    FW_Common::SetLedColorFromMode(); // 恢复根据当前模式的颜色
                #endif // LED_ENABLE
            } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Trigger) {
                FW_Common::SetMode(FW_Const::GunMode_Calibration);
            } else if(FW_Common::buttons.pressedReleased == FW_Const::RunModeNormalBtnMask) {
                FW_Common::SetRunMode(FW_Const::RunMode_Normal);
            } else if(FW_Common::buttons.pressedReleased == FW_Const::RunModeAverageBtnMask) {
                FW_Common::SetRunMode(FW_Common::runMode == FW_Const::RunMode_Average ? FW_Const::RunMode_Average2 : FW_Const::RunMode_Average);
            } else if(FW_Common::buttons.pressedReleased == FW_Const::IRSensitivityUpBtnMask) {
                IncreaseIrSensitivity(OF_Prefs::profiles[OF_Prefs::currentProfile].irSens);
            } else if(FW_Common::buttons.pressedReleased == FW_Const::IRSensitivityDownBtnMask) {
                DecreaseIrSensitivity(OF_Prefs::profiles[OF_Prefs::currentProfile].irSens);
            } else if(FW_Common::buttons.pressedReleased == FW_Const::SaveBtnMask) {
                FW_Common::SavePreferences();
            #ifdef USES_RUMBLE
                } else if(FW_Common::buttons.pressedReleased == FW_Const::RumbleToggleBtnMask && OF_Prefs::pins[OF_Const::rumbleSwitch] >= 0) {
                    RumbleToggle();
            #endif // USES_RUMBLE
            #ifdef USES_SOLENOID
                } else if(FW_Common::buttons.pressedReleased == FW_Const::SolenoidToggleBtnMask && OF_Prefs::pins[OF_Const::solenoidSwitch] >= 0) {
                    SolenoidToggle();
            #endif // USES_SOLENOID
            } else SelectCalProfileFromBtnMask(FW_Common::buttons.pressedReleased);

            if(!OF_Serial::serialMode)
                OF_Serial::PrintResults();
            
            break;
        case FW_Const::GunMode_Docked:
            ExecGunModeDocked();
            break;
        case FW_Const::GunMode_Calibration:
            FW_Common::ExecCalMode();
            break;
        default:
            /* ---------------------- LET'S GO --------------------------- */
            switch(FW_Common::runMode) {
            case FW_Const::RunMode_Processing:
                //ExecRunModeProcessing();
                //break;
            case FW_Const::RunMode_Average:
            case FW_Const::RunMode_Average2:
            case FW_Const::RunMode_Normal:
            default:
                ExecRunMode();
                break;
            }
            break;
    }

#ifdef DEBUG_SERIAL
    OF_Serial::PrintDebugSerial();
#endif // DEBUG_SERIAL
}

/*        -----------------------------------------------        */
/* --------------------------- METHODS ------------------------- */
/*        -----------------------------------------------        */

// Main core loop
void ExecRunMode()
{
#ifdef DEBUG_SERIAL
    Serial.print("exec run mode ");
    Serial.println(FW_Const::RunModeLabels[FW_Common::runMode]);
#endif

    if(BoyMode::IsEnabled())
        FW_Common::buttons.ReportDisable();
    else
        FW_Common::buttons.ReportEnable();
    if(FW_Common::justBooted) {
        // center the joystick so RetroArch doesn't throw a hissy fit about uncentered joysticks
        delay(100);  // Exact time needed to wait seems to vary, so make a safe assumption here.
        Gamepad16.releaseAll();
        FW_Common::justBooted = false;
    }

    #if /*defined(ARDUINO_ARCH_RP2040) &&*/ defined(DUAL_CORE)
        // wake up second core
        #ifdef ARDUINO_ARCH_ESP32
            esp32_fifo.push(0);
        #else // rp2040
        rp2040.fifo.push(0);
        #endif
    #endif // ARDUINO_ARCH_RP2040 && DUAL_CORE

