wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
            } else if(pauseHoldStarted) {
                unsigned long t = millis();
                if(t - pauseHoldStartstamp > OF_Prefs::settings[OF_Const::holdToPauseLength]) {
                    // MAKE SURE EVERYTHING IS DISENGAGED:
                    OF_FFB::FFBShutdown();
                    FW_Common::SetMode(FW_Const::GunMode_Pause);
                    return;
                }
            }
        } else {
            if(FW_Common::buttons.pressedReleased == FW_Const::EnterPauseModeBtnMask || FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Home) {
                // MAKE SURE EVERYTHING IS DISENGAGED:
                OF_FFB::FFBShutdown();
                FW_Common::SetMode(FW_Const::GunMode_Pause);
                return;
            }
        }
        #else  // if we're using dual cores, check the fifo.
        #ifdef ARDUINO_ARCH_ESP32
        if(esp32_fifo.pop_nb(&fifoData)) {
        #else // rp2040
        if(rp2040.fifo.pop_nb(&fifoData)) {
        #endif
            FW_Common::SetMode((FW_Const::GunMode_e)fifoData);
            fifoData = 0;
            // the value doesn't matter; all core1 is doing is waiting for any signal from the FIFO.
            #ifdef ARDUINO_ARCH_ESP32
                esp32_fifo.push(true);
            #else // rp2040
            rp2040.fifo.push(true);
            #endif
            return;
        }
        #endif // ARDUINO_ARCH_RP2040 || DUAL_CORE

#ifdef DEBUG_SERIAL
        ++frameCount;
        OF_Serial::PrintDebugSerial();
#endif // DEBUG_SERIAL
    }
}

// from Samco_4IR_Test_BETA sketch
// for use with the Samco_4IR_Processing_Sketch_BETA Processing sketch
void ExecRunModeProcessing()
{
    FW_Common::buttons.ReportDisable();

    #ifdef USES_DISPLAY
        FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_IRTest);
    #endif // USES_DISPLAY

    for(;;) {
        FW_Common::buttons.Poll(1);

        if(Serial.available()) {
            #ifdef USES_DISPLAY
                FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Docked);
            #endif // USES_DISPLAY

            OF_Serial::SerialProcessingDocked();
        }

        if(FW_Common::runMode != FW_Const::RunMode_Processing)
            return;

        if(FW_Common::irPosUpdateTick) {
            FW_Common::irPosUpdateTick = 0;
            FW_Common::GetPosition();
        }
    }
}

// For use with the OpenFIRE app when it connects to this board.
void ExecGunModeDocked()
{
    FW_Common::buttons.ReportDisable();
    FW_Common::buttons.ReleaseAll();

    #ifdef LED_ENABLE
        OF_RGB::LedUpdate(127, 127, 255);
    #endif // LED_ENABLE

    unsigned long tempChecked = millis();
    unsigned long aStickChecked = millis();
    unsigned long currentMillis = millis();

    char buf[96];
    int pos = sprintf(&buf[0], "%.1f"
                                #ifdef GIT_HASH
                                "-%s"
                                #endif // GIT_HASH
                                , OPENFIRE_VERSION
                                #ifdef GIT_HASH
                                , GIT_HASH
                                #endif // GIT_HASH
                      );
#ifdef OPENFIRE_APP_FORK_BUILD
    pos += snprintf(&buf[pos], sizeof(buf) - (size_t)pos, "+%s", OPENFIRE_APP_FORK_TAG_STR);
#endif
    buf[pos++] = OF_Const::serialTerminator;
    pos += sprintf(&buf[pos], "%s", OPENFIRE_BOARD);
    buf[pos++] = OF_Const::serialTerminator;
    memcpy(&buf[pos], &OF_Prefs::usb, sizeof(OF_Prefs::USBMap_t));
    pos += sizeof(OF_Prefs::USBMap_t);
    if(FW_Common::camNotAvailable) {
        buf[pos++] = OF_Const::serialTerminator;
        buf[pos++] = OF_Const::sError;
    }
    Serial.write(buf, pos);
    Serial.flush();

    for(;;) {
        FW_Common::buttons.Poll(1);
        currentMillis = millis();

        if(!FW_Common::dockedSaving) {
            if(FW_Common::buttons.pressed) {
                for(uint i = 0; i < ButtonCount; ++i)
                    if(bitRead(FW_Common::buttons.pressed, i)) {
                        buf[0] = OF_Const::sBtnPressed, buf[1] = i;
                        Serial.write(buf, 2);
                    }
            }

            if(FW_Common::buttons.released) {
                for(uint i = 0; i < ButtonCount; ++i)
                    if(bitRead(FW_Common::buttons.released, i)) {
                        buf[0] = OF_Const::sBtnReleased, buf[1] = i;
                        Serial.write(buf, 2);
                    }
            }

            #ifdef USES_TEMP
                if(OF_Prefs::pins[OF_Const::tempPin] > -1) {
                    OF_FFB::TemperatureUpdate();

                    if(currentMillis - tempChecked >= 1000) {
                        buf[0] = OF_Const::sTemperatureUpd, buf[1] = OF_FFB::temperatureCurrent;
                        Serial.write(buf, 2);

                        tempChecked = currentMillis;
                    }
                }
            #endif // USES_TEMP
            
            #ifdef USES_ANALOG
                if(FW_Common::analogIsValid && currentMillis - aStickChecked >= 100) {
                    aStickChecked = currentMillis;

                    #ifdef ARDUINO_ARCH_ESP32
                    // LETTURA HARDWARE (uint16_t per coerenza ADC 12-bit)
                    uint16_t rawX = (uint16_t)analogRead(OF_Prefs::pins[OF_Const::analogX]);
                    uint16_t rawY = (uint16_t)analogRead(OF_Prefs::pins[OF_Const::analogY]);

                    // NORMALIZZAZIONE (Identica alla funzione AnalogStickPoll)
                    uint16_t analogValueX, analogValueY;

                    // Normalizzazione Asse X
                    if (rawX < ANALOG_STICK_DEADZONE_X_MIN) 
                        analogValueX = (uint16_t)map(rawX, 0, ANALOG_STICK_DEADZONE_X_MIN, 0, ANALOG_STICK_CENTER_X);
                    else if (rawX > ANALOG_STICK_DEADZONE_X_MAX) 
                        analogValueX = (uint16_t)map(rawX, ANALOG_STICK_DEADZONE_X_MAX, 4095, ANALOG_STICK_CENTER_X, 4095);
                    else 
                        analogValueX = ANALOG_STICK_CENTER_X;

                    // Normalizzazione Asse Y
                    if (rawY < ANALOG_STICK_DEADZONE_Y_MIN) 
                        analogValueY = (uint16_t)map(rawY, 0, ANALOG_STICK_DEADZONE_Y_MIN, 0, ANALOG_STICK_CENTER_Y);
                    else if (rawY > ANALOG_STICK_DEADZONE_Y_MAX) 
                        analogValueY = (uint16_t)map(rawY, ANALOG_STICK_DEADZONE_Y_MAX, 4095, ANALOG_STICK_CENTER_Y, 4095);
                    else 
                        analogValueY = ANALOG_STICK_CENTER_Y;
                    #else                  
                    // Leggiamo il valore puro dall'ADC (0-4095)
                    uint16_t analogValueX = analogRead(OF_Prefs::pins[OF_Const::analogX]);
                    uint16_t analogValueY = analogRead(OF_Prefs::pins[OF_Const::analogY]);
                    #endif // COMMENTO
                    
