wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
        int32_t adjX = filtX + offsetX;
        int32_t adjY = filtY + offsetY;

        // 限制在 ADC 合法范围内
        if (adjX < ANALOG_STICK_MIN_X) adjX = ANALOG_STICK_MIN_X;
        if (adjX > ANALOG_STICK_MAX_X) adjX = ANALOG_STICK_MAX_X;
        if (adjY < ANALOG_STICK_MIN_Y) adjY = ANALOG_STICK_MIN_Y;
        if (adjY > ANALOG_STICK_MAX_Y) adjY = ANALOG_STICK_MAX_Y;

        // 如果启用了“画圈校准（范围+中心）”，则把校准后的边缘范围缩放到完整 0..4095
        int32_t normX = adjX;
        int32_t normY = adjY;
        if (OF_Const::settingsTypesCount > OF_Const::analogCalValid &&
            OF_Prefs::settings[OF_Const::analogCalValid]) {
            normX = scale_with_cal(adjX, OF_Prefs::settings[OF_Const::analogCalMinX], OF_Prefs::settings[OF_Const::analogCalMaxX]);
            normY = scale_with_cal(adjY, OF_Prefs::settings[OF_Const::analogCalMinY], OF_Prefs::settings[OF_Const::analogCalMaxY]);
            // scale_with_cal 的输出范围是 ANALOG_STICK_MIN_X..MAX_X（与 X 相同的常量），对 Y 也适用
            if (normY < ANALOG_STICK_MIN_Y) normY = ANALOG_STICK_MIN_Y;
            if (normY > ANALOG_STICK_MAX_Y) normY = ANALOG_STICK_MAX_Y;
        }

        // 应用 X/Y 轴反转（在死区/缩放处理之后，映射到 Stick 物理范围）
        if (OF_Const::settingsTypesCount > OF_Const::analogInvertX &&
            OF_Prefs::settings[OF_Const::analogInvertX]) {
            normX = ANALOG_STICK_MIN_X + ANALOG_STICK_MAX_X - normX;
        }
        if (OF_Const::settingsTypesCount > OF_Const::analogInvertY &&
            OF_Prefs::settings[OF_Const::analogInvertY]) {
            normY = ANALOG_STICK_MIN_Y + ANALOG_STICK_MAX_Y - normY;
        }

        // 按整个量程的一半计算死区范围（4095/2 ≈ 2048）
        int32_t halfRange = (ANALOG_STICK_MAX_X - ANALOG_STICK_MIN_X) / 2; // 理论上约 2047
        int32_t dzIn      = (int32_t)halfRange * (int32_t)dzPercent / 100; // ADC 单位（进入死区阈值）
        // 加一点回滞，避免在阈值附近来回“抖动切换”
        int32_t dzHyst    = halfRange / 50; // ~2%
        if (dzHyst < 8) dzHyst = 8;
        int32_t dzOut     = dzIn + dzHyst;  // 离开死区阈值

        int32_t dx = normX - (int32_t)ANALOG_STICK_CENTER_X;
        int32_t dy = normY - (int32_t)ANALOG_STICK_CENTER_Y;

        // 按轴独立死区 + 回滞（比“X/Y 同时在死区”更稳定）
        static bool inDeadX = true;
        static bool inDeadY = true;

        int32_t adx = abs(dx);
        int32_t ady = abs(dy);

        if (inDeadX) {
            if (adx > dzOut) inDeadX = false;
        } else {
            if (adx < dzIn) inDeadX = true;
        }

        if (inDeadY) {
            if (ady > dzOut) inDeadY = false;
        } else {
            if (ady < dzIn) inDeadY = true;
        }

        uint16_t outX = (uint16_t)(inDeadX ? ANALOG_STICK_CENTER_X : (int)normX);
        uint16_t outY = (uint16_t)(inDeadY ? ANALOG_STICK_CENTER_Y : (int)normY);
        Gamepad16.moveStick(outX, outY);
    } else {
        uint32_t newPos = 0;
        // 与 analogModeStick 分支统一：settings 中保存的是“相对偏移量”（有符号），直接相加校正中心
        int32_t offX = (int32_t)OF_Prefs::settings[OF_Const::analogCenterOffsetX];
        int32_t offY = (int32_t)OF_Prefs::settings[OF_Const::analogCenterOffsetY];
        int32_t adjX = (int32_t)analogValueX + offX;
        int32_t adjY = (int32_t)analogValueY + offY;

        // 限制在 ADC 合法范围内
        if (adjX < ANALOG_STICK_MIN_X) adjX = ANALOG_STICK_MIN_X;
        if (adjX > ANALOG_STICK_MAX_X) adjX = ANALOG_STICK_MAX_X;
        if (adjY < ANALOG_STICK_MIN_Y) adjY = ANALOG_STICK_MIN_Y;
        if (adjY > ANALOG_STICK_MAX_Y) adjY = ANALOG_STICK_MAX_Y;

        // 画圈校准的范围缩放（让 DPad/Keys 的阈值判断也更稳定）
        if (OF_Const::settingsTypesCount > OF_Const::analogCalValid &&
            OF_Prefs::settings[OF_Const::analogCalValid]) {
            // 复用上面的缩放逻辑（X/Y 都映射到 0..4095）
            const int32_t minX = (int32_t)OF_Prefs::settings[OF_Const::analogCalMinX];
            const int32_t maxX = (int32_t)OF_Prefs::settings[OF_Const::analogCalMaxX];
            const int32_t minY = (int32_t)OF_Prefs::settings[OF_Const::analogCalMinY];
            const int32_t maxY = (int32_t)OF_Prefs::settings[OF_Const::analogCalMaxY];
            if (maxX > minX) {
                if (adjX <= minX) adjX = ANALOG_STICK_MIN_X;
                else if (adjX >= maxX) adjX = ANALOG_STICK_MAX_X;
                else adjX = (int32_t)(ANALOG_STICK_MIN_X + (((int64_t)(adjX - minX) * (ANALOG_STICK_MAX_X - ANALOG_STICK_MIN_X) + (int64_t)(maxX - minX) / 2) / (int64_t)(maxX - minX)));
            }
            if (maxY > minY) {
                if (adjY <= minY) adjY = ANALOG_STICK_MIN_Y;
                else if (adjY >= maxY) adjY = ANALOG_STICK_MAX_Y;
                else adjY = (int32_t)(ANALOG_STICK_MIN_Y + (((int64_t)(adjY - minY) * (ANALOG_STICK_MAX_Y - ANALOG_STICK_MIN_Y) + (int64_t)(maxY - minY) / 2) / (int64_t)(maxY - minY)));
            }
        }

        // TODO: need to consider inverted axis toggle, currently assumes axises are inverted by default
        if(adjY < (ANALOG_STICK_DEADZONE_Y_MIN-700))
            newPos = 2; // down
        else if(adjY > (ANALOG_STICK_DEADZONE_Y_MAX+700))
            newPos = 1; // up

        if(adjX < (ANALOG_STICK_DEADZONE_X_MIN-700))
            newPos |= 8; // right
        else if(adjX > (ANALOG_STICK_DEADZONE_X_MAX+700))
            newPos |= 4; // left

        switch(OF_Prefs::settings[OF_Const::analogMode]) {
        case OF_Const::analogModeDpad: Gamepad16.padUpdate(FW_Common::buttons.PadMaskConvert(newPos)); break;
        case OF_Const::analogModeKeys:
            {
                // 方向顺序: i=0 上, i=1 下, i=2 左, i=3 右
                // 箭头键: 库要求 k>=136，传 (HID码+136)；字母键: 库用 k 当 ASCII 查表，故 WASD 传 'w'/'a'/'s'/'d'
                static const uint8_t keysArrows[4] = { KEY_UP_ARROW, KEY_DOWN_ARROW, KEY_LEFT_ARROW, KEY_RIGHT_ARROW };
                static const uint8_t keysWASD[4]   = { (uint8_t)'w', (uint8_t)'s', (uint8_t)'a', (uint8_t)'d' };
                const uint8_t* keys = (OF_Prefs::settings[OF_Const::analogKeysLayout] == OF_Const::analogKeysLayoutWASD) ? keysWASD : keysArrows;
                if (FW_Common::aStickADCLastPos ^ newPos) {
                    for (int i = 0; i < 4; ++i) {
                        if (FW_Common::aStickADCLastPos ^ newPos & 1 << i)
                            Keyboard.release(keys[i]);
                    }
                }
                for (int i = 0; i < 4; ++i) {
                    if (newPos & 1 << i)
                        Keyboard.press(keys[i]);
                }
            }
            break;
        }
        FW_Common::aStickADCLastPos = newPos;
    }
}
// =========== [ESP32_PORT] fine funzione ottimizzata con calibrazione =======================
#else // rp2040
void AnalogStickPoll()
{
    int analogValueX = analogRead(OF_Prefs::pins[OF_Const::analogX]);
    int analogValueY = analogRead(OF_Prefs::pins[OF_Const::analogY]);
    
    if(OF_Prefs::settings[OF_Const::analogMode] == OF_Const::analogModeStick) {
        // Analog stick deadzone should help mitigate overwriting USB commands for the other input channels.
        if((analogValueX < 1900 || analogValueX > 2200) ||
        (analogValueY < 1900 || analogValueY > 2200)) {
            Gamepad16.moveStick(analogValueX, analogValueY);
        } else {
            // Duplicate coords won't be reported, so no worries.
            Gamepad16.moveStick(2048, 2048);
        }
    } else {
        uint32_t newPos = 0;

        // TODO: need to consider inverted axis toggle, currently assumes axises are inverted by default
        // would this also benefit from custom Analog->Digital deadzone?
        if(analogValueY < 1200)
            newPos = 2; // down
        else if(analogValueY > 2900)
            newPos = 1; // up

