wei134102/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
        if(analogValueX < 1200)
            newPos |= 8; // right
        else if(analogValueX > 2900)
            newPos |= 4; // left

        switch(OF_Prefs::settings[OF_Const::analogMode]) {
        case OF_Const::analogModeDpad: Gamepad16.padUpdate(FW_Common::buttons.PadMaskConvert(newPos)); break;
        case OF_Const::analogModeKeys:
            if(FW_Common::aStickADCLastPos ^ newPos) {
                for(int i = 0; i < 4; ++i) {
                    if(FW_Common::aStickADCLastPos ^ newPos & 1 << i)
                        Keyboard.release(KEY_UP_ARROW-i);
                }
            }
            for(int i = 0; i < 4; ++i) {
                if(newPos & 1 << i)
                    Keyboard.press(KEY_UP_ARROW-i);
            }
            break;
        }
        FW_Common::aStickADCLastPos = newPos;
    }
        
}
#endif //ARDUINO_ARCH_ESP32 

#endif // USES_ANALOG

void SendEscapeKey()
{
    if (PlayTimer::AreInputsLocked()) {
        return;
    }
    Keyboard.press(KEY_ESC);  // [ESP32_PORT] non corrisponde a HID_KEY_ESCAPE, ma lasciato come impostato
    Keyboard.report();
    delay(20);  // wait a bit so it registers on the PC.
    Keyboard.release(KEY_ESC); // [ESP32_PORT] non corrisponde a HID_KEY_ESCAPE, ma lasciato come impostato
    Keyboard.report();
    lastUSBpoll = millis();
}

// Simple Pause Menu scrolling function
// Bool determines if it's incrementing or decrementing the list
// LEDs update according to the setting being scrolled onto, if any.
void SetPauseModeSelection(const bool &isIncrement)
{
    if(isIncrement) {
        if(FW_Common::pauseModeSelection == FW_Const::PauseMode_EscapeSignal) {
            FW_Common::pauseModeSelection = FW_Const::PauseMode_AnalogCenterCal;
        } else {
            FW_Common::pauseModeSelection++;
            // If we use switches, and they ARE mapped to valid pins,
            // then skip over the manual toggle options.
            #ifdef USES_SWITCHES
                #ifdef USES_RUMBLE
                #ifdef PauseMode_RumbleFFToggle
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleFFToggle &&
                !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                    FW_Common::pauseModeSelection++;
                }
                #endif // PauseMode_RumbleFFToggle
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleToggle &&
                (OF_Prefs::pins[OF_Const::rumbleSwitch] >= 0 || OF_Prefs::pins[OF_Const::rumblePin] == -1)) {
                    FW_Common::pauseModeSelection++;
                }
            #endif // USES_RUMBLE
                #ifdef USES_SOLENOID
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_SolenoidToggle &&
                (OF_Prefs::pins[OF_Const::solenoidSwitch] >= 0 || OF_Prefs::pins[OF_Const::solenoidPin] == -1)) {
                    FW_Common::pauseModeSelection++;
                }
            #endif // USES_SOLENOID
            if(FW_Common::pauseModeSelection == FW_Const::PauseMode_AutofireToggle &&
            (OF_Prefs::pins[OF_Const::autofireSwitch] >= 0 || !OF_Prefs::toggles[OF_Const::solenoid])) {
                FW_Common::pauseModeSelection++;
            }
                //wei134102 add start
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_ModeChange) {
                    // ModeChange is always visible
                }
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_LowButtonToggle) {
                    // LowButtonToggle is always visible
                }
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_LayoutToggle) {
                    // LayoutToggle is always visible
                }                                
                //wei134102 add end
            #else
                #ifdef USES_RUMBLE
                    #ifdef PauseMode_RumbleFFToggle
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleFFToggle &&
                    !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                        FW_Common::pauseModeSelection++;
                    }
                    #endif // PauseMode_RumbleFFToggle                
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleToggle &&
                    !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                        FW_Common::pauseModeSelection++;
                    }
                #endif // USES_RUMBLE
                #ifdef USES_SOLENOID
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_SolenoidToggle &&
                    !(OF_Prefs::pins[OF_Const::solenoidPin] >= 0)) {
                        FW_Common::pauseModeSelection++;
                    }
                #endif // USES_SOLENOID
            #endif // USES_SWITCHES
        }
    } else {
        if(FW_Common::pauseModeSelection == FW_Const::PauseMode_AnalogCenterCal) {
            FW_Common::pauseModeSelection = FW_Const::PauseMode_EscapeSignal;
        } else {
            FW_Common::pauseModeSelection--;
            #ifdef USES_SWITCHES
                #ifdef USES_SOLENOID
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_SolenoidToggle &&
                    (OF_Prefs::pins[OF_Const::solenoidSwitch] >= 0 || OF_Prefs::pins[OF_Const::solenoidPin] == -1)) {
                        FW_Common::pauseModeSelection--;
                    }
                #endif // USES_SOLENOID
                #ifdef USES_RUMBLE
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleToggle &&
                    (OF_Prefs::pins[OF_Const::rumbleSwitch] >= 0 || OF_Prefs::pins[OF_Const::rumblePin] == -1)) {
                        FW_Common::pauseModeSelection--;
                    }
                    #ifdef PauseMode_RumbleFFToggle
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleFFToggle &&
                    !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                        FW_Common::pauseModeSelection--;
                    }
                    #endif // PauseMode_RumbleFFToggle                    
                #endif // USES_RUMBLE
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_AutofireToggle &&
                (OF_Prefs::pins[OF_Const::autofireSwitch] >= 0 || !OF_Prefs::toggles[OF_Const::solenoid])) {
                    FW_Common::pauseModeSelection--;
                }                
                //wei134102 add start
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_ModeChange) {
                    // ModeChange is always visible
                }
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_LayoutToggle) {
                    // LayoutToggle is always visible
                }                                
                //wei134102 add end
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_ModeChange) {
            #else
                #ifdef USES_SOLENOID
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_SolenoidToggle &&
                    !(OF_Prefs::pins[OF_Const::solenoidPin] >= 0)) {
                        FW_Common::pauseModeSelection--;
                    }
                #endif // USES_SOLENOID
                #ifdef USES_RUMBLE
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleToggle &&
                    !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                        FW_Common::pauseModeSelection--;
                    }

